2.2.013/src/Catalogs/МК_ЗаявленияСотрудников/МК_ЗаявленияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ЗаявленияСотрудников</name>
  <attributes>
    <name>МК_ВидЗаявления</name>
    <type>
      <types>CatalogRef.МК_НастройкиСвязиЗаявленийКЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.МК_СтатусыЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПодписанияОчередногоУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ1С</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявкиНаОтсутствие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента1С</name>
    <type>
      <types>EnumRef.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</types>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставРоли</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписант</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/Enums/МК_ОбрабатываемыеВидыДокументовПоЗаявлениям/МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</name>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Enums/МК_СтатусыЗаявлений/МК_СтатусыЗаявлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыЗаявлений</name>
  <enumValues>
    <name>НаПодписании</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Недействителен</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_ЗаявленияСотрудников/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПосмотретьФайл(Команда)	
	мФайл = ЭтаФорма.Объект.МК_ПутьКФайлу;    
	мPDF = ПолучитьФайл(мФайл); 
	Если НЕ (мPDF = Неопределено) Тогда
		мPDF.Показать("Заявление"); 
	КонецЕсли;  
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФайл(мФайл) 
	Возврат Справочники.МК_ЗаявленияСотрудников.СкачатьФайлНаСервере(мФайл,1);  
КонецФункции


&НаСервере
Функция СоздатьДокументНаСервере()
	мВозврат = Новый Массив;	
	мИмяФормы = Неопределено;                 
    	
	мЗначения = Новый Структура("Организация, Сотрудник", Объект.Организация, Объект.Сотрудник);
	ДанныеОтсутствия = Неопределено;   
	мВидОтсутствия = Объект.ТипДокумента1С;

	Если ТипЗнч(мВидОтсутствия) = Тип("ПеречислениеСсылка.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям") Тогда  // Предопределенные элементы   
		мПараметры = Новый Структура;
		Если мВидОтсутствия = Перечисления.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Командировка Тогда     
			мИмяФормы = "Документ.Командировка.Форма.ФормаДокумента";    
			мЗначения.Вставить("ДатаНачала", Объект.ДатаНачала);
			мЗначения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
			мЗначения.Вставить("ДатаКомандировки", Объект.ДатаНачала);
			мЗначения.Вставить("ДатаНачалаСобытия", Объект.ДатаНачала);
		    //мЗначения.Вставить("ВнутрисменнаяКомандировка", НЕ мОбъект.Целосменный);
			//мЗначения.Вставить("ОплачиватьЧасов", мОбъект.КолвоЧасовОтсутствия);    
			мЗначения.Вставить("Действие", "Заполнить"); 
			мЗначения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);    
			мПараметры.Вставить("Основание", мЗначения);
		ИначеЕсли мВидОтсутствия = Перечисления.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Отгул Тогда    
			мИмяФормы = "Документ.Отгул.Форма.ФормаДокумента";    
			мЗначения.Вставить("ДатаНачала", Объект.ДатаНачала);
			мЗначения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
			//мЗначения.Вставить("ДатаОтсутствия", Объект.ДатаНачала);			
		    //мЗначения.Вставить("ВнутрисменнаяКомандировка", НЕ мОбъект.Целосменный);
			//мЗначения.Вставить("ОплачиватьЧасов", мОбъект.КолвоЧасовОтсутствия);    
			мЗначения.Вставить("Действие", "Заполнить"); 
			мЗначения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);    
			мПараметры.Вставить("Основание", мЗначения);

		//ИначеЕсли мВидОтсутствия.Объект1С = "Отпуск по беременности и родам" Тогда	
		ИначеЕсли мВидОтсутствия = Перечисления.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.ОтпускПоУходуЗаРебенком Тогда	 
			мИмяФормы = "Документ.ОтпускПоУходуЗаРебенком.Форма.ФормаДокумента";    
			мЗначения.Вставить("ДатаНачала", Объект.ДатаНачала);
			мЗначения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
			мЗначения.Вставить("ДатаНачалаПФР", Объект.ДатаНачала);
			мЗначения.Вставить("ОсновнойСотрудник", Объект.Сотрудник);     
			мЗначения.Вставить("Сотрудник", Объект.Сотрудник.ФизическоеЛицо);

			
		    //мЗначения.Вставить("ВнутрисменнаяКомандировка", НЕ мОбъект.Целосменный);
			//мЗначения.Вставить("ОплачиватьЧасов", мОбъект.КолвоЧасовОтсутствия);    
			мЗначения.Вставить("Действие", "ЗаполнитьПоПараметрамЗаполнения"); 
			//мЗначения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);    
			мПараметры.Вставить("Основание", мЗначения);     
		ИначеЕсли мВидОтсутствия = Перечисления.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.ОтсутствиеССохранениемОплаты Тогда	 
			мИмяФормы = "Документ.ОплатаПоСреднемуЗаработку.Форма.ФормаДокумента";    
			мЗначения.Вставить("ДатаНачала", Объект.ДатаНачала);
			мЗначения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
			мЗначения.Вставить("ВидВремени",Объект.МК_ВидЗаявления.ВидВремени);	
		    //мЗначения.Вставить("ВнутрисменнаяКомандировка", НЕ мОбъект.Целосменный);
			//мЗначения.Вставить("ОплачиватьЧасов", мОбъект.КолвоЧасовОтсутствия);    
			мЗначения.Вставить("Действие", "Заполнить"); 
			мЗначения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);    
			мПараметры.Вставить("Основание", мЗначения); 
			
		ИначеЕсли мВидОтсутствия = Перечисления.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Увольнение Тогда	 
			мИмяФормы = "Документ.Увольнение.Форма.ФормаДокумента";    
			мЗначения.Вставить("ДатаУвольнения", Объект.ДатаНачала);
			//мЗначения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
			//мЗначения.Вставить("ВидВремени",Объект.МК_ВидЗаявления.ВидВремени);	
		    //мЗначения.Вставить("ВнутрисменнаяКомандировка", НЕ мОбъект.Целосменный);
			//мЗначения.Вставить("ОплачиватьЧасов", мОбъект.КолвоЧасовОтсутствия);    
			мЗначения.Вставить("Действие", "Заполнить"); 
			мЗначения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);    
			мПараметры.Вставить("Основание", мЗначения); 
	
		//ИначеЕсли мВидОтсутствия.Объект1С = "Больничный лист" Тогда	   
		//	мПозицияСелектора = 0;  // Больничный
		//	мИмяФормы = "Документ.ПрогулНеявка.Форма.ФормаДокумента";    
		//	мЗначения.Вставить("ДатаНачала", мОбъект.ДатаНачалаОтсутствия);
		//	мЗначения.Вставить("ДатаОкончания", мОбъект.ДатаЗавершенияОтсутствия);		    			
		//	мЗначения.Вставить("Действие", "ЗаполнитьПоПараметрамЗаполнения");  		 
		//	мЗначения.Вставить("СостояниеСотрудника", Перечисления.СостоянияСотрудника.Болезнь);
		//	мПараметры.Вставить("Основание", мЗначения);
		КонецЕсли;			
	Иначе                  // Отпуска.                            
		мПараметры = Новый Структура("Основание,ОсновнойОтпуск",,Ложь);
		мВидОтпуска = мВидОтсутствия;		 
    
		Если мВидОтпуска.ОтпускБезОплаты = Истина Тогда   // Создаем документ "Отпуск без оплаты"    
			мИмяФормы = "Документ.ОтпускБезСохраненияОплаты.Форма.ФормаДокумента";   			
			ДанныеОтсутствия = ДанныеОтпусков(мВидОтпуска, мЗначения.Сотрудник, Объект); //мОбъект);    
			//мЗначения.Вставить("ОтсутствиеВТечениеЧастиСмены", Не мОбъект.Целосменный);      
			//мЗначения.Вставить("ЧасовОтпуска",мОбъект.КолвоЧасовОтсутствия);
		ИначеЕсли мВидОтпуска.ОтпускЯвляетсяЕжегодным Тогда                             // Тут - обычный отпуск     
			мИмяФормы = "Документ.Отпуск.Форма.ФормаДокумента";    
			Если ПолучитьФункциональнуюОпцию("ИспользоватьОбщийПериодОтпускаВДокументах") Тогда
				мПараметры.ОсновнойОтпуск = Истина;
				мПараметры.Вставить("НачалоОтпуска", Объект.ДатаНачала);
				мПараметры.Вставить("ОкончаниеОтпуска", Объект.ДатаОкончания);
			Иначе
				мПараметры.ОсновнойОтпуск = Истина;
				ДанныеОтсутствия = ДанныеОтпусков(Справочники.ВидыОтпусков.Основной, мЗначения.Сотрудник, Объект);
			КонецЕсли;   
			мЗначения.Вставить("ДатаНачалаОсновногоОтпуска",Объект.ДатаНачала);
			мЗначения.Вставить("ДатаОкончанияОсновногоОтпуска",Объект.ДатаОкончания);    
			мЗначения.Вставить("УчитыватьМРОТПриОплатеПоСреднемуЗаработку",Истина);   
		Иначе
			мИмяФормы = "Документ.Отпуск.Форма.ФормаДокумента";    
			ДанныеОтсутствия = ДанныеОтпусков(мВидОтпуска, мЗначения.Сотрудник, Объект);				
		КонецЕсли;	                     
		
		мЗначения.Вставить("Ссылка", Неопределено);
		мЗначения.Вставить("Действие", "Заполнить");  
		
		ДанныеОтсутствий = Новый Массив;
		Если ЗначениеЗаполнено(ДанныеОтсутствия) Тогда
			ДанныеОтсутствий.Добавить(ДанныеОтсутствия);
		КонецЕсли;
	    мЗначения.Вставить("ДанныеОтпусков", ДанныеОтсутствий);
		мПараметры.Основание = мЗначения;
	КонецЕсли;			
	
	мВозврат.Добавить(мИмяФормы);
	мВозврат.Добавить(мПараметры);
	мВозврат.Добавить(0);
	Возврат мВозврат;

КонецФункции


&НаСервере
Функция ДанныеОтпусков(ВидОтпуска, Сотрудник, мОбъект)
	
	ВидОтпускаРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидОтпуска, "СпособРасчетаОтпуска, ОтпускЯвляетсяЕжегодным");
	
	ДанныеОтпуска = НовыйДанныеОтпуска();
	ДанныеОтпуска.ВидОтпуска = ВидОтпуска; 
	ДанныеОтпуска.ДатаНачала = мОбъект.ДатаНачала;
	ДанныеОтпуска.ДатаОкончания = мОбъект.ДатаОкончания;
	//ДанныеОтпуска.КоличествоДней = мОбъект.КолвоДнейОтсутствия;
	ДанныеОтпуска.КоличествоДней = 0;
	ПоКалендарнымДням = (ВидОтпускаРеквизиты.СпособРасчетаОтпуска = Перечисления.СпособыРасчетаОтпуска.ВКалендарныхДнях);   
	Если ДанныеОтпуска.КоличествоДней = 0 Тогда
		ДанныеОтпуска.КоличествоДней = 
			УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Сотрудник, мОбъект.ДатаНачала,
															 мОбъект.ДатаОкончания, ПоКалендарнымДням, 
															 ВидОтпускаРеквизиты.ОтпускЯвляетсяЕжегодным);
	КонецЕсли;														 

	Возврат ДанныеОтпуска;
	
КонецФункции  

&НаКлиентеНаСервереБезКонтекста
Функция НовыйДанныеОтпуска()
		
	СтруктураОтпуска = Новый Структура;
		
	СтруктураОтпуска.Вставить("ВидОтпуска");
	СтруктураОтпуска.Вставить("ДатаНачала", Дата(1, 1, 1, 0, 0, 0));
	СтруктураОтпуска.Вставить("ДатаОкончания", Дата(1, 1, 1, 0, 0, 0));
	СтруктураОтпуска.Вставить("КоличествоДней");
	СтруктураОтпуска.Вставить("КоличествоДнейКомпенсации", 0);
	//СтруктураОтпуска.Вставить("НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", '00010101');
	//СтруктураОтпуска.Вставить("КонецПериодаЗаКоторыйПредоставляетсяОтпуск", '00010101');
	СтруктураОтпуска.Вставить("Основание", "");
	СтруктураОтпуска.Вставить("ВидОтпускаПрежний", Неопределено);
	СтруктураОтпуска.Вставить("ИндексСтрокиДокумента", Неопределено);
	
	Возврат СтруктураОтпуска;
	
КонецФункции


&НаКлиенте
Процедура СоздатьДокумент(Команда)
	мРезультат = СоздатьДокументНаСервере();   
	мИмяФормы = мРезультат[0];
	Если мИмяФормы = Неопределено Тогда
		Сообщить("Такой вид документа пока не может быть создан");
	Иначе	
		мПараметры = мРезультат[1];     
		ОткрытьФорму(мИмяФормы, мПараметры, ЭтаФорма, Истина);		
	КонецЕсли;	
КонецПроцедуры      


&НаСервереБезКонтекста
Функция ПолучитьСотрудникаИДаты(мСсылка)	
	мВозврат = Новый Структура("Сотрудник, ДатаНачала",мСсылка.Сотрудник,мСсылка.ДатаНачала);
	Возврат мВозврат;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСотрудникаИДатуУвольнения(мСсылка)	
	мВозврат = Новый Структура("Сотрудник, ДатаУвольнения",мСсылка.Сотрудник,мСсылка.ДатаУвольнения);
	Возврат мВозврат;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мИмяФайла = СокрЛП(ЭтаФорма.Объект.МК_ПутьКФайлу); 
	мДлина = СтрДлина(мИмяФайла);            
	мИндекс = СтрНайти(мИмяФайла, "/", НаправлениеПоиска.СКонца); 
	мИмяФайла = Прав(мИмяФайла, мДлина - мИндекс);   
	ЭтаФорма.Элементы.ПосмотретьФайл.Заголовок = мИмяФайла;  
	мДок1С = ЭтаФорма.Объект.Документ1С;
		
	ЭтаФорма.Элементы.ПросмотрСсылкиНаЗаявлениеМК.Заголовок = ЭтаФорма.СсылкаНаЗаявлениеМК;
	
	// Надо прописать видимость кнопок        	
	Если НЕ ЗначениеЗаполнено(Объект.ТипДокумента1С) ИЛИ ЗначениеЗаполнено(мДок1С) ИЛИ     
		 Объект.СтатусЗаявления = ПредопределенноеЗначение("Перечисление.МК_СтатусыЗаявлений.Недействителен") ИЛИ
		 Объект.СтатусЗаявления = ПредопределенноеЗначение("Перечисление.МК_СтатусыЗаявлений.Отклонен") Тогда
		Элементы.СоздатьДокумент.Видимость = Ложь;
	КонецЕсли;	 
	
	// Надо определить, есть ли текущий пользователь (физлицо) в списке
	// текущих подписантов (исполнителей). Искать в табличной части "СоставРоли".
	// Если есть, нужно кнопки "Исполнить" и "Отклонить" сделать видимыми.
	мТаб = Объект.СоставРоли;
	мФЛ = ЭтаФорма.ВладелецФормы.Родитель.Пользователь;	
	мЕсть = Ложь;
	Для Каждого мСтр Из мТаб Цикл
		Если мСтр.Подписант = мФЛ Тогда
			мЕсть = Истина;  
			ЭтаФорма.НомерУчастника = мСтр.Номер;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если мЕсть Тогда 
		Элементы.Исполнить.Видимость = Истина;	
		Элементы.Отклонить.Видимость = Истина;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ОбработатьЗаявление(мСсылкаНаДокумент)       
	//мОбъект = Запись.Заявка.ПолучитьОбъект();
	//мОбъект.СтатусЗаявки = Перечисления.МК_СтатусыЗаявокНаОтсутствия.Выполнена;	
	Объект.Документ1С = мСсылкаНаДокумент;  
	//Если мСсылкаНаДокумент.Проведен Тогда
	//	Объект.СтатусДокумента1С = "Документ проведен";
	//Иначе	                                           
		Объект.СтатусДокумента1С = "Документ создан"; 
	//КонецЕсли;	
	//мОбъект = мСсылкаНаДокумент.ПолучитьОбъект();
	//мОбъект.Документ1С = мСсылкаНаДокумент;
	ЭтаФорма.Записать();   	
	// Надо удалить все записи с этой заявкой в регистре МК_МоиЗадания
	//Набор = РегистрыСведений.МК_МоиЗадания.СоздатьНаборЗаписей();
	//Набор.Отбор.Заявка.Установить(Запись.Заявка);	
	//Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Параметр - ссылка на документ. Надо прописать ее в заявление, если документ записан  
	мНашеОповещение = Ложь;     
	мНаимДок = "";
	Если (ИмяСобытия = "ЗаписанДокументОтпуск" ИЛИ 
		ИмяСобытия = "ЗаписанДокументОтпускБезСохраненияОплаты") 
		И Источник.ВладелецФормы = ЭтаФорма Тогда
		//ЗаполнитьОтсутствияПоДругимМестамРаботы();		
		ОбработатьЗаявление(Параметр);  
		мНашеОповещение = Истина;
	ИначеЕсли ИмяСобытия = "ЗаписьДокументаКомандировка"  И Источник = ЭтаФорма Тогда 
		ОбработатьЗаявление(Параметр.Ссылка);   	
		мНашеОповещение = Истина;   
	ИначеЕсли ИмяСобытия = "ЗаписьДокументаОплатаПоСреднемуЗаработку"  И Источник = ЭтаФорма Тогда 
		ОбработатьЗаявление(Параметр.Ссылка);   	
		мНашеОповещение = Истина;   		
	ИначеЕсли ИмяСобытия = "Запись_Отгул"  Тогда 
		мСтр = ПолучитьСотрудникаИДаты(Источник);
		Если мСтр.Сотрудник = Объект.Сотрудник И мСтр.ДатаНачала = Объект.ДатаНачала Тогда
			мНашеОповещение = Истина;
			ОбработатьЗаявление(Источник);
			мНаимДок = "Отгул";
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "Запись_Увольнение"  Тогда 
		мСтр = ПолучитьСотрудникаИДатуУвольнения(Источник);
		Если мСтр.Сотрудник = Объект.Сотрудник И мСтр.ДатаУвольнения = Объект.ДатаНачала Тогда
			мНашеОповещение = Истина;
			ОбработатьЗаявление(Источник);
			мНаимДок = "Увольнение";
		КонецЕсли;		
	ИначеЕсли ИмяСобытия = "Запись_ПрогулНеявка" Тогда    
		// Почему-то в параметрах оповещения для прогула/неявки нет ссылки на форму-владельца. Сделаем проверку по реквизитам документа: если сотрудник
		// и дата начала события совпадают, будем считать, что это наш документ.
		мСтр = ПолучитьСотрудникаИДаты(Источник);
		Если мСтр.Сотрудник = ЭтаФорма.Запись.Сотрудник И мСтр.ДатаНачала = ЭтаФорма.Запись.ДатаНачала Тогда
			мНашеОповещение = Истина;
			ОбработатьЗаявление(Источник);
			мНаимДок = "Прогул/неявка";
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "Запись_ОтпускПоУходуЗаРебенком"  Тогда 
		мСтр = ПолучитьСотрудникаИДаты(Источник);
		Если мСтр.Сотрудник =  ФизЛицоСотрудника(Объект.Сотрудник) И мСтр.ДатаНачала = Объект.ДатаНачала Тогда
			мНашеОповещение = Истина;
			ОбработатьЗаявление(Источник);
			мНаимДок = "ОтпускПоУходуЗаРебенком";
		КонецЕсли;	
	КонецЕсли;	
	Если мНашеОповещение Тогда				
		ЭтаФорма.Элементы.СоздатьДокумент.Видимость = Ложь;     	   
		ЭтаФорма.ОбновитьОтображениеДанных();    		
		ЭтаФорма.ВладелецФормы.Родитель.Элементы.Список.Обновить();    
		ОтправитьСообщениеОСозданииДокументаВМК()
	КонецЕсли;		
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ФизЛицоСотрудника(мСсылка)
	Возврат мСсылка.ФизическоеЛицо;
КонецФункции	

&НаСервере 
Функция мПредставление(мДок)                
	мНаим = "Документ";
	ОбъектОписания = Метаданные.НайтиПоТипу(ТипЗнч(мДок)); 
	Если ОбъектОписания <> Неопределено Тогда 
   		мВозврат = ОбъектОписания.Имя + " " + мДок.Номер + " от " + Формат(мДок.Дата, "ДФ=dd.MM.yyyy"); 	
	КонецЕсли;
	Возврат мВозврат;
КонецФункции	


&НаСервере
Процедура ПерерисоватьПодписантов(мСтр) 
	мСписокПодписантов = "";       // Это не совсем теперь состав роли. При параллельном подписании сюда надо включать всех, кто еще текущий. в т.ч. это могут быть и роли
	// Изменим статус заявления 
	Объект.СтатусЗаявления = Справочники.МК_ЗаявленияСотрудников.ПолучитьСтатусЗаявления(мСтр.status);      
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	// Очистим табличную часть
	Объект.Подписанты.Очистить();	
	Объект.СоставРоли.Очистить();	
	Для Каждого мПодписант Из мСтр.approvals Цикл
		мНоваяСтрока = Объект.Подписанты.Добавить();
		мНоваяСтрока.Имя = мПодписант.name;
		мНоваяСтрока.Номер = мПодписант.id;            
		Если мПодписант.type = "role" Тогда
			мНоваяСтрока.Тип = "Роль";
			мСоставРоли = "";       
			мИндекс = 0;
			Для Каждого мУчастник Из мПодписант.user_ids Цикл   
				мФИО = Неопределено;
				Если Не (мУчастник = Неопределено) Тогда   
					мФЛ = ОО.НайтиФЛ(мУчастник); 
					Если НЕ мФЛ = Неопределено Тогда
						мФИО = мФЛ.Фамилия + " " + мФЛ.Инициалы; 
					КонецЕсли;	                               
				КонецЕсли;
				Если мФИО = Неопределено И НЕ (мПодписант.user_names = Неопределено) Тогда
				  	// Физлицо не найдено. Нужно достать ФИО из другого массива.						
					мФИО = "[" + мПодписант.user_names[мИндекс] + "]";     
				ИначеЕсли мПодписант.pointer Тогда					// Сохранять будем только текущих подписантов. Нужны реально только они.
					мНоваяРоль = Объект.СоставРоли.Добавить();
					мНоваяРоль.Номер = мПодписант.id;
					мНоваяРоль.Подписант = мФЛ;
				КонецЕсли;	                                                          					
				Если НЕ ПустаяСтрока(мСоставРоли) Тогда
					мСоставРоли = мСоставРоли + ", " ;
				КонецЕсли;							
				мСоставРоли = мСоставРоли + мФИО;
				мИндекс = мИндекс + 1;
			КонецЦикла;	                              
			мНоваяСтрока.СоставРоли = мСоставРоли;
			Если мПодписант.pointer Тогда	
				Если НЕ ПустаяСтрока(мСписокПодписантов) Тогда
					мСписокПодписантов = мСписокПодписантов + ", " ;
				КонецЕсли;							                 
				мСписокПодписантов = мСписокПодписантов + мСоставРоли;
				Объект.Роль = мСписокПодписантов;
			КонецЕсли;	
		Иначе	                      
			мНоваяСтрока.Тип = "";    
			Если мПодписант.pointer Тогда
				мФЛ = ОО.НайтиФЛ(мПодписант.user_ids[0]); 
				Если мФЛ = Неопределено Тогда
					мФИО = "[" + мПодписант.Name + "]";  
					мНоваяСтрока.Имя = мФИО;
				Иначе
					мФИО = мФЛ.Фамилия + " " + мФЛ.Инициалы;        
					мНоваяРоль = Объект.СоставРоли.Добавить();
					мНоваяРоль.Номер = мПодписант.id;
					мНоваяРоль.Подписант = мФЛ;                     
				КонецЕсли;
				Если НЕ ПустаяСтрока(мСписокПодписантов) Тогда
					мСписокПодписантов = мСписокПодписантов + ", " ;
				КонецЕсли;							  
				мСписокПодписантов = мСписокПодписантов + мФИО;
				Объект.Роль = мСписокПодписантов;
                Объект.ТекущийПодписант = мФЛ;				
			КонецЕсли;	
		КонецЕсли;   
		Если мСписокПодписантов = "" Тогда // Это значит, что уже нет действующих подписантов, все завершилось. Ставят задачу показать последнего  
			мИндекс = Объект.Подписанты.Количество() - 1;
			мПоследний = Объект.Подписанты[мИндекс];
			Если мПоследний.Тип = "Роль" Тогда 
				Объект.Роль = мПоследний.СоставРоли;
			Иначе                                         
				Объект.Роль = мПоследний.Имя;
			КонецЕсли;	
		КонецЕсли;
		Если мПодписант.type_signature = "qes" Тогда
			мНоваяСтрока.ТипПодписи = "УКЭП";
		ИначеЕсли мПодписант.type_signature = "nqes" Тогда
			мНоваяСтрока.ТипПодписи = "УНЭП";	
		ИначеЕсли мПодписант.type_signature = "none" Тогда
			мНоваяСтрока.ТипПодписи = "Без подписи";
		КонецЕсли;	
		мНоваяСтрока.Статус = Справочники.МК_ЗаявленияСотрудников.ПолучитьСтатусПодписания(мПодписант.status);			
		мНоваяСтрока.ТекущийПодписант = мПодписант.pointer;     		
	КонецЦикла;  	                                            
	ЭтаФорма.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура ИсполнитьОтклонить(мРежим)                             
	мПользователь = ЭтаФорма.ВладелецФормы.Родитель.Пользователь;  
	мНомерУчастника = ЭтаФорма.НомерУчастника;                                                          
	мМК_КодЗаявления = Объект.МК_КодЗаявления;
	мДокумент1С = Объект.Документ1С;
	мРез = ИсполнитьОтклонитьСервер(мРежим, мПользователь,мМК_КодЗаявления, мНомерУчастника, мДокумент1С); 
	// После исполнения нужно по новой вычислить - является ли текущий пользователь сейчас подписантом. Чаще всего это не так.
	// Если является, надо вычислить следующий номер подписанта и зафиксировать в переменной "НомерУчастника" на этой форме.
	// Если не является, надо сделать кнопки Исполнить/Отклонить невидимыми.  
	Если мРез.Результат Тогда
		мНашел = Ложь;
		мТЗ = Объект.СоставРоли;
		Для Каждого мСтр Из мТЗ Цикл
			Если мСтр.Подписант = мПользователь Тогда
				мНомерУчастника = мСтр.Номер;
				мНашел = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	  
		Если мНашел Тогда
			ЭтаФорма.НомерУчастника = мНомерУчастника;
		Иначе
			Элементы.Исполнить.Видимость = Ложь;
			Элементы.Отклонить.Видимость = Ложь;
		КонецЕсли;	
	
		ЭтаФорма.ОбновитьОтображениеДанных(); 
		ОповеститьОбИзменении(Объект.Ссылка);
	Иначе             
		ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ИсполнитьОтклонитьСервер(мРежим, мПользователь,мМК_КодЗаявления, мНомерУчастника, мДокумент1С)
    мРез = Справочники.МК_ЗаявленияСотрудников.ИсполнитьОтклонитьНаСервере(мРежим, мПользователь,мМК_КодЗаявления, мНомерУчастника, мДокумент1С);
	//Если мРез.Результат Тогда
	ПерерисоватьПодписантов(мРез.Подписанты);  // Перерисовать надо в любом случае.
	//КонецЕсли;	
	Возврат мРез;
КонецФункции

&НаКлиенте
Процедура Исполнить(Команда)  
	ИсполнитьОтклонить(1);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)                                     
	ИсполнитьОтклонить(2);
КонецПроцедуры


&НаСервере
Функция ВычислитьАдресСсылки()
	мНаим = Константы.МК_Сервер.Получить();
	Если Прав(мНаим, 1) = "/" Тогда
		мНаим = Лев(мНаим, СтрДлина(мНаим)-1);
	КонецЕсли;	
	мНаим = мНаим + "/edms/applications/"+Формат(Объект.МК_КодЗаявления, "ЧГ=0");
	Возврат мНаим;
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мАдрес = ВычислитьАдресСсылки();
	ЭтаФорма.СсылкаНаЗаявлениеМК = мАдрес;
КонецПроцедуры


&НаКлиенте
Процедура СсылкаНаЗаявлениеМК(Команда)
	ЗапуститьПриложение(ЭтаФорма.СсылкаНаЗаявлениеМК);
КонецПроцедуры

&НаКлиенте
Функция ОтправитьСообщениеОСозданииДокументаВМК()  
	ИсполнитьОтклонить(3);
КонецФункции
